Practica Calificada 5 CC3S2/Intro Rails/rottenpotatoes-rails-intro/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
---
  def show
    id = params[:id]
    begin
      @movie = Movie.find(id)

SELECT "movies".* FROM "movies"  ORDER BY release_date asc
---
  def index
    # Obtener todas las películas o filtrar por calificaciones seleccionadas
    @movies = Movie.all