Depuración-Rails/myrottenpotatoes/app/controllers/movies_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    #raise.params.inspect

    @movie = Movie.find(id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]

  def create
    if (@movie = Movie.create(movie_params))
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "T"], ["rating", "G"], ["description", nil], ["release_date", "2023-10-31 00:00:00"], ["created_at", "2023-10-31 01:22:13.195627"], ["updated_at", "2023-10-31 01:22:13.195627"]]